app/controllers/users/registrations_controller.rb

  def create
    params[:user].permit!
    @user = User.new(email: params.dig(:user,:email), password: params.dig(:user,:password))

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('111@111.com', '$2a$11$tyUkM3lcRYrFFsM4NJa3Ke3LJvPuCAhztin/HF132KD32c8/oclQO', '2018-09-07 03:46:06', '2018-09-07 03:46:06')